app/admin/dashboard.rb

SELECT SUM("orders"."total_price") FROM "orders" WHERE "orders"."status" = ?  [["status", 1]]
---
      column do
        panel "Calculated Revenue" do
          div class: "dashboard-stat positive" do
            h1 number_to_currency(Order.where(status: :paid).sum(:total_price))

SELECT COUNT(*) FROM "orders"
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = ?  [["status", 1]]
---
      column do
        panel "Total Orders" do
           div class: "dashboard-stat neutral" do
            h1 Order.count
            span "#{Order.where(status: :paid).count} Paid"

SELECT COUNT(*) FROM "users" WHERE "users"."role" = ?  [["role", 0]]
---
      column do
        panel "Total Customers" do
           div class: "dashboard-stat neutral" do
            h1 User.where(role: :customer).count

SELECT COUNT(*) FROM "products" WHERE (stock < 10)
---

      column do
        panel "Low Stock Alert" do
          low_stock_count = Product.where("stock < ?", 10).count

SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
---
    columns do
      column do
        panel "Recent Orders" do
          table_for Order.order(created_at: :desc).limit(10) do

SELECT "users".* FROM "users" WHERE "users"."role" = ? ORDER BY "users"."created_at" DESC LIMIT ?  [["role", 0], ["LIMIT", 10]]
---

      column do
        panel "New Customers" do
          table_for User.where(role: :customer).order(created_at: :desc).limit(10) do