app/admin/orders.rb

SELECT SUM("order_items"."quantity") FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
      status_tag order.status, class: order.status == 'paid' ? 'yes' : 'no'
    end
    column :items_count do |order|
      order.order_items.sum(:quantity)

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 2]]
---
    end

    panel "Order Items" do
      table_for order.order_items do

SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 2]]
---
    attributes_table_for order.user do
      row :email
      row :role
      row("Total Orders") { order.user.orders.count }