app/views/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
                <tbody>
                  <% order.order_items.each do |item| %>