app/views/carts/show.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? LIMIT ?  [["cart_id", 1], ["LIMIT", 1]]
---

  <% if @cart.nil? || @cart.cart_items.empty? %>

SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
---
          <div class="card-header bg-white border-bottom p-4">
             <h5 class="fw-bold mb-0">Cart Items (<%= @cart.cart_items.count %>)</h5>

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
---
          <div class="card-body p-0">
            <% @cart.cart_items.each do |item| %>

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                    <div class="card border-0 rounded-3 overflow-hidden">
                       <img src="https://loremflickr.com/150/150/<%= item.product.name.downcase.split.first %>?lock=<%= item.product.id %>" class="img-fluid" alt="<%= item.product.name %>">