app/controllers/application_controller.rb

  def set_cart
    if user_signed_in?
      @cart = current_user.cart || current_user.create_cart
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2026-01-03 18:01:10.666170"], ["updated_at", "2026-01-03 18:01:10.666170"]]