app/controllers/carts_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2026-01-03 18:01:10.666170"], ["updated_at", "2026-01-03 18:01:10.666170"]]
---
  def show
    @cart = current_user.cart || current_user.create_cart

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def add_item
    @product = Product.find(params[:product_id])

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["cart_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def remove_item
    @cart_item = current_user.cart.cart_items.find(params[:id])
    @cart_item.destroy

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."id" = ? LIMIT ?  [["cart_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 2], ["updated_at", "2026-01-03 18:06:23.362190"], ["id", 2]]
---
  def update_item
    @cart_item = current_user.cart.cart_items.find(params[:id])
    if @cart_item.update(quantity: params[:quantity])