app/controllers/checkout_controller.rb

  def create
    @cart = current_user.cart

    if @cart.nil? || @cart.cart_items.empty?
      redirect_to root_path, alert: "Cart is empty"
      return
    end

    # Check for COD or missing/invalid Stripe keys
    if params[:payment_method] == 'cod' || !stripe_configured?
      handle_mock_order
      return
    end

    begin
      session = Stripe::Checkout::Session.create(
        payment_method_types: ['card'],
        line_items: @cart.cart_items.map { |item|
          {
            price_data: {
              currency: 'usd',
              product_data: {
                name: item.product.name,
              },
              unit_amount: (item.product.price * 100).to_i,
            },
            quantity: item.quantity,
          }
        },
        mode: 'payment',
        success_url: checkout_success_url + '?session_id={CHECKOUT_SESSION_ID}',
        cancel_url: checkout_cancel_url,
        customer_email: current_user.email,
        metadata: {
          user_id: current_user.id
        }
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? LIMIT ?  [["cart_id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def handle_mock_order(error_message: nil)
    # Direct Order Creation for Demo/COD
    ActiveRecord::Base.transaction do
      order = current_user.orders.create!(
        total_price: @cart.total_price,
        status: :paid # or :pending for COD
      )

      @cart.cart_items.each do |cart_item|
        order.order_items.create!(
          product: cart_item.product,
          quantity: cart_item.quantity,
          price: cart_item.product.price
        )
      end

      @cart.cart_items.destroy_all
---
INSERT INTO "orders" ("user_id", "total_price", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["total_price", 1999.98], ["status", 1], ["created_at", "2026-01-03 18:06:39.462587"], ["updated_at", "2026-01-03 18:06:39.462587"]]
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 1], ["product_id", 1], ["quantity", 2], ["price", 999.99], ["created_at", "2026-01-03 18:06:39.486083"], ["updated_at", "2026-01-03 18:06:39.486083"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]