app/controllers/home_controller.rb

SELECT "products".* FROM "products" WHERE (stock > 0) LIMIT ?  [["LIMIT", 4]]
SELECT "categories".* FROM "categories"
---
  def index
    @featured_products = Product.active.limit(4)
    @categories = Category.all