app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? ORDER BY "orders"."created_at" DESC  [["user_id", 2]]
---
  def index
    @orders = current_user.orders.order(created_at: :desc)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def track
    if params[:order_id].present?
      @order = Order.find_by(id: params[:order_id])