app/controllers/products_controller.rb

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @categories = Category.all
    if params[:category_id]
      @category = Category.find(params[:category_id])

SELECT "products".* FROM "products" WHERE (stock > 0) AND "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @product = Product.active.find(params[:id])