app/models/cart.rb

  def total_price
    cart_items.sum { |item| item.product.price * item.quantity }
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]