app/views/products/index.html.erb

              </a>
              <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"

                  </span>
                  <span class="badge bg-light text-dark rounded-pill"><%= category.products.count %></span>
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = ? AND (stock > 0)  [["category_id", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]