app/views/layouts/application.html.erb

                <i class="fas fa-shopping-bag fa-lg"></i>
                <% if @cart && @cart.cart_items.any? %>
                  <span class="position-absolute top-0 start-100 translate-middle badge rounded-circle bg-danger border border-white p-1" style="font-size: 0.6rem; min-width: 1.25rem;">
                    <%= @cart.cart_items.count %>
---
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = ? LIMIT ?  [["cart_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]